harrywyatt5/detecting-humans-computer-vision/src/Sam3ContextBuilder.cpp
#include "Sam3ContextBuilder.h"

#include <vector>
#include <memory>
#include <filesystem>
#include <onnxruntime_cxx_api.h>
#include <onnxruntime_c_api.h>

Sam3ContextBuilder::Sam3ContextBuilder() {
    applicationName = "Sam3Model";
    textEncoderPath = "./sam3-onnx/text-encoder-fp16.onnx";
    visionEncoderPath = "./sam3-onnx/vision-encoder-fp16.onnx";
    decoderPath = "./sam3-onnx/geo-encoder-mask-decoder-fp16.onnx";
    loggingLevel = ORT_LOGGING_LEVEL_WARNING;
    optimisationLevel = GraphOptimizationLevel::ORT_ENABLE_ALL;
    deviceId = 0;
    cudaOptions.device_id = 0;
    maxCPUThreads = 1;
    batchLimit = 1;
    numBoxesLimit = 1;
    useInt8 = false;
    calibrationPath = "";

    tensorRTOptionsNames = {
        "device_id",
        "trt_fp16_enable",
        "trt_max_workspace_size",
        "trt_engine_cache_enable",
        "trt_engine_cache_path",
        "trt_cuda_graph_enable",
        "has_user_compute_stream",
        "user_compute_stream",
        "trt_int8_enable",
        "trt_int8_calibration_table_name",
        "trt_int8_use_native_calibration_table"
    };
    tensorRTOptions = {
        "0",
        "1",
        "6442450944", // 6GB
        "1",
        "./trt_cache",
        "0",
        "0",
        "0",
        "0",
        "",
        "0"
    };
}

Sam3ContextBuilder& Sam3ContextBuilder::withApplicationName(const std::string& name) {
    applicationName = name;
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withLoggingLevel(const OrtLoggingLevel& loggingLevel) {
    this->loggingLevel = loggingLevel;
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withGraphOptimistionLevel(const GraphOptimizationLevel& optimisationLevel) {
    this->optimisationLevel = optimisationLevel;
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withDeviceId(const int deviceId) {
    this->deviceId = deviceId;
    cudaOptions.device_id = deviceId;
    tensorRTOptions[0] = std::to_string(deviceId);
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withFP16Enabled(const bool enabled) {
    tensorRTOptions[1] = enabled ? "1" : "0";
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withCPUThreadMax(const int count) {
    maxCPUThreads = count;
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withMaxGPUMemory(const uint64_t max) {
    tensorRTOptions[2] = std::to_string(max);
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withEngineCacheDir(const std::string& location) {
    tensorRTOptions[4] = location;
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withTextEncoderPath(const std::string& location) {
    textEncoderPath = location;
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withVisionEncoderPath(const std::string& location) {
    visionEncoderPath = location;
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withDecoderPath(const std::string& location) {
    decoderPath = location;
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withBatchLimit(const int64_t count) {
    batchLimit = count;
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withNumBoxesLimit(const int64_t count) {
    numBoxesLimit = count;
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withCudaGraphsEnabled(const bool enabled) {
    tensorRTOptions[5] = enabled ? "1" : "0";
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withComputeStreamEnabled(const bool enabled) {
    tensorRTOptions[6] = enabled ? "1" : "0";
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withComputeStream(cudaStream_t& computeStream) {
    // Force enable the setting
    withComputeStreamEnabled(true);
    tensorRTOptions[7] = std::to_string(reinterpret_cast<size_t>(computeStream));
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withUseInt8ForEncoder(const bool enabled) {
    // For this property as well as the calibration path, we store these settings in the builder
    // and then enact them when actually building. Saves us having to store two lists of property names
    // and vales for making the SessionOptions
    useInt8 = true;
    return *this;
}

Sam3ContextBuilder& Sam3ContextBuilder::withInt8NativeCalibration(const std::string& location) {
    calibrationPath = location;
    return *this;
}

Sam3Context Sam3ContextBuilder::build() const {
    Ort::Env env(loggingLevel, applicationName.c_str());
    auto api = Ort::GetApi();

    Ort::SessionOptions sessionOptions;
    OrtTensorRTProviderOptionsV2* tensorOptions = nullptr;
    OrtTensorRTProviderOptionsV2* encoderOptions = nullptr;
    Ort::ThrowOnError(api.CreateTensorRTProviderOptions(&tensorOptions));
    Ort::ThrowOnError(api.CreateTensorRTProviderOptions(&encoderOptions));

    // We have to create an array of the values to feed to the provider options
    // std::string doesn't do! We need const char*
    std::vector<const char*> tensorValueArray;
    for (size_t i = 0; i < tensorRTOptions.size(); ++i) {
        tensorValueArray.push_back(tensorRTOptions[i].c_str());
    }

    // Mod our array and then convert it to const chars, like above, for encoder
    std::vector<std::string> encoderTensorValueArrayCpy = tensorRTOptions;
    if (useInt8) {
        encoderTensorValueArrayCpy[8] = "1";
        encoderTensorValueArrayCpy[9] = calibrationPath;
        encoderTensorValueArrayCpy[10] = calibrationPath != "" ? "1" : "0";
    }
    std::vector<const char*> encoderTensorValueArray;
    for (size_t i = 0; i < encoderTensorValueArrayCpy.size(); ++i) {
        encoderTensorValueArray.push_back(encoderTensorValueArrayCpy[i].c_str());
    }

    Ort::ThrowOnError(
        api.UpdateTensorRTProviderOptions(
            tensorOptions,
            tensorRTOptionsNames.data(),
            tensorValueArray.data(),
            tensorRTOptionsNames.size()
        )
    );
    Ort::ThrowOnError(
        api.UpdateTensorRTProviderOptions(
            encoderOptions,
            tensorRTOptionsNames.data(),
            encoderTensorValueArray.data(),
            tensorRTOptionsNames.size()
        )
    );

    sessionOptions.SetGraphOptimizationLevel(optimisationLevel);
    sessionOptions.SetIntraOpNumThreads(maxCPUThreads);
    sessionOptions.SetInterOpNumThreads(maxCPUThreads);

    // 0 means that batch is unbounded, and can be any value
    if (batchLimit > 0) {
        sessionOptions.AddFreeDimensionOverrideByName("batch", batchLimit);
    }

    if (numBoxesLimit > 0) {
        sessionOptions.AddFreeDimensionOverrideByName("num_boxes", numBoxesLimit);
    }

    // Copy current session options
    Ort::SessionOptions encoderOptions = sessionOptions;
    sessionOptions.AppendExecutionProvider_TensorRT_V2(*tensorOptions);
    sessionOptions.AppendExecutionProvider_CUDA(cudaOptions);
    api.ReleaseTensorRTProviderOptions(tensorOptions);

    // Creates the caching directory so we can save there
    const std::string& cachePath = tensorRTOptions[4];
    std::filesystem::create_directories(cachePath);

    return Sam3Context(
        std::move(env),
        std::move(sessionOptions),
        deviceId,
        std::move(textEncoderPath),
        std::move(visionEncoderPath),
        std::move(decoderPath),
        Ort::MemoryInfo("Cuda", OrtDeviceAllocator, deviceId, OrtMemTypeDefault),
        Ort::MemoryInfo("Cpu", OrtDeviceAllocator, 0, OrtMemTypeCPUInput)
    );
}

void Sam3ContextBuilder::applyUniversalSessionOptions(std::vector<Ort::SessionOptions>& sessionOptions) const {
    for (auto& option : sessionOptions) {
        
    }
}